-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Янв 08 2024 г., 09:37
-- Версия сервера: 10.4.28-MariaDB
-- Версия PHP: 8.1.17

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `informatsion_portal`
--

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

CREATE TABLE `categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `name`, `created_at`, `updated_at`) VALUES
(2, 'Sport', '2023-01-29 04:38:19', '2023-01-29 04:38:19'),
(3, 'Jahan', '2023-01-29 04:38:27', '2023-01-29 04:38:27'),
(4, 'Ozbekstan', '2023-01-29 04:38:36', '2023-01-29 04:38:36'),
(5, 'Biznes', '2023-01-29 08:52:28', '2023-01-29 08:52:28');

-- --------------------------------------------------------

--
-- Структура таблицы `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2023_01_29_061422_create_categories_table', 1),
(5, '2023_01_29_061651_create_news_table', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE `news` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` text NOT NULL,
  `description` text NOT NULL,
  `image` text NOT NULL,
  `category_id` int(11) NOT NULL,
  `count` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `news`
--

INSERT INTO `news` (`id`, `title`, `description`, `image`, `category_id`, `count`, `created_at`, `updated_at`) VALUES
(1, 'Ўзбекистонда 30 январ куни ҳарорат 13 даражагача кўтарилиши кутилмоқда', 'Республика Гидрометеорология маркази 30 январ, душанба куни кузатиладиган об-ҳаво ҳақида маълумот берди.\r\n\r\nТошкент шаҳрида ҳаво ўзгариб туради, ёғингарчилик кутилмайди. Кечаси ва эрталаб туман тушиши мумкин Шамол шарқдан 3-8 метр/секунд тезликда эсади. Ҳарорат кечаси 2-4 даража совуқ, кундузи 7-9 даража илиқ бўлади.\r\n\r\nҚорақалпоғистон Республикаси, Хоразм вилоятида ҳаво ўзгариб туради, ёғингарчилик кутилмайди. Баъзи жойларга туман тушиши мумкин. Шамол шарқдан 7-12 метр/секунд тезликда эсади. Ҳарорат кечаси 8-13 даража совуқ, кундузи 2-7 даража илиқ бўлади.\r\n\r\nБухоро, Навоий вилоятларида ҳаво ўзгариб туради, ёғингарчилик кутилмайди. Баъзи жойларга туман тушиши мумкин. Шамол шарқдан 7-12 метр/секунд тезликда эсади. Ҳарорат кечаси 0-5 даража совуқ, кундузи 5-10 даража илиқ бўлади.\r\n\r\nТошкент, Самарқанд, Жиззах, Сирдарё вилоятларида ҳаво ўзгариб туради, ёғингарчилик кутилмайди. Баъзи жойларга туман тушиши мумкин. Шамол шарқдан 7-12 метр/секунд тезликда эсади. Ҳарорат кечаси 0-5 даража совуқ, кундузи 5-10 даража илиқ бўлади.\r\n\r\nҚашқадарё, Сурхондарё вилоятларида ҳаво ўзгариб туради, ёғингарчилик кутилмайди. Баъзи жойларга туман тушиши мумкин. Шамол шарқдан 7-12 метр/секунд тезликда эсади. Ҳарорат кечаси 0-5 даража совуқ, кундузи 8-13 даража илиқ бўлади.\r\n\r\nАндижон, Наманган, Фарғона вилоятларида ҳаво ўзгариб туради, ёғингарчилик кутилмайди. Баъзи жойларга туман тушиши мумкин. Шамол шарқдан 5-10 метр/секунд тезликда эсади. Ҳарорат кечаси 3-8 даража совуқ, кундузи 2-7 даража илиқ бўлади.\r\n\r\nРеспубликанинг тоғли ҳудудларида ҳаво ўзгариб туради, ёғингарчилик кутилмайди. Шамол шарқдан 7-12 метр/секунд тезликда эсади. Ҳарорат кечаси 3-8 даража совуқ, кундузи 2-7 даража илиқ бўлади.', 'images/1675000480.jpg', 4, 0, '2023-01-29 08:54:40', '2023-01-29 08:54:40'),
(2, 'Нега Ўзбекистонда ижтимоий фанларга қизиқувчилар кўпроқ? – табиий ва аниқ фанларни қийинлаштираётган сабаблар', 'Мактаб таълими инсон умрининг энг муҳим босқичи ҳисобланади. Айнан мана шу даврда болалар келажакда айнан қайси касб эгаси бўлишлари ҳақида танлов қилишади ва шу фанни яхши ўзлаштириш учун ҳаракат қилишади.Йигирма биринчи асрда меҳнат бозорида харидоргир бўлиш учун STEM фанларини (бу тўплам ичида кимё, биология, физика, математика фанлари бор) яхши билиш керак. Лекин бизда ҳануз ижтимоий фанлар: тарих, она тили, чет тилига қизиқиш ва уни ўрганишга талаб юқорироқ бўлиб қолмоқда.Нега бундай деб ҳисоблаш мумкин?Мактаб битирувчилари қизиқишларини баҳолаш учун асосий статистикаларни собиқ Давлат тест маркази – ҳозирги Билим ва малакаларни баҳолаш агентлиги ўтказадиган кириш имтиҳонлари натижаларини кўриб чиқиш мумкин.Кириш имтиҳонларида максимал балл – 189,0 бўлса, Тошкент давлат юридик университетига грант кирганлар айни шу баллни тўплай олишган. Бу ОТМга кириш учун ўтиш балли ҳам 186 баллдан кам бўлмаган. ОТМга кириш учун абитуриентлар тарих ва чет тили – ижтимоий фанлардан имтиҳон топширган. Натижа юқорилиги рақобат ҳам шунга яраша бўлганини кўрсатади.Тошкент ахборот технологиялари университети учун эса кириш имтиҳонларида асосий фан математика ҳисобланади ва университетда “Сунъий интеллект”, “Киберхавфсизлик” каби замонавий йўналишлар мавжуд. Бироқ ОТМга ўтиш баллида энг юқори балл 172,2 баллгача чиққан. Юридик университет билан солиштирса, нисбатан паст.Кимё ва биология фанларидан имтиҳон олинадиган Тошкент тиббиёт академиясида ҳам энг юқори балл 180 га етмаган.Бу рақамларнинг ўзи билангина ижтимоий фанларга қизиқиш юқорилигини хулосалаш тўғри эмасдир, лекин нуфузли ОТМлар рўйхатида юридик университетлар, Жаҳон иқтисодиёти ва дипломатияси университети борлигини ҳам ҳаммамиз биламиз. Табиий фанлардан имтиҳон олинадиган ОТМларнинг обрўйи эса у қадар баланд эмас.  Нега?Мавзу бўйича фейсбук ижтимоий тармоғи орқали фойдаланувчилар фикрини ўрганишга ҳаракат қилдик. “Нега ўқувчиларнинг ижтимоий фанларга қизиқиши юқорироқ?” деган саволимизга тармоқ фойдаланувчилари келтирган сабабларнинг асосийлари қуйидагилар:Мактабларда амалий фанларни ўрганиш учун лабораториялар шароитлари яхши эмас;Аниқ ва табиий фанларни ўқитиш методлари устида ишлаш керак;Дарсликлар мураккаб, улар содда ва тушунарли эмас;Ўзбекистон меҳнат бозорида аниқ ва табиий фанлар талаб қилинадиган касбларнинг даромади юқори эмас;Ўқитувчилар малакаси етарли эмас;Уйда ота-оналарнинг болалари билан аниқ ва табиий фанлардан шуғулланиш учун билими етарли эмас.“Билим пулга айланиши керак...”Республика таълим маркази директори ўринбосари, математика фанидан ўқувчиларга дарс берган Исроил Тиллабоев ижтимоий фанларга қизиқиш нима сабабдан баланд экани ҳақидаги саволимизга бу танланадиган касб обрўйи ва у келтирадиган даромад билан боғлиқ деб жавоб берди.“Жамиятда қайси соҳа эгаси яхши яшаса, одамларда ўша соҳага оид фанга қизиқиш кучаяди. Масалан, 60-70 йилларда қайси мактабга кириб ўқувчилардан “Қайси касб эгаси бўласан”, деб сўралса, уларнинг аксари “Космонавт бўламан”, деб жавоб берганини катта авлод вакиллари гапиради. Ҳозир эса қайси бола космонавт бўламан, дейди? Йўқ, менимча, ҳозир болаларнинг аксари 90 йиллардан буён яшаш шароити ва мавқейи яхши бўлиб келаётган соҳа касбларини санайди: “Прокурор бўламан, судя бўламан ёки ҳуқуқ-тартибот органи ходими бўламан”, деб жавоб беради. Ижтимоий фанларга талаб ошишига биринчи сабаб – шу. Ва бу фанларда рақобат кучайди, рақобат кучайгани билимни кучлироқ эгаллаш мажбуриятини юзага келтирди”, дейди Исроил Тиллабоев.Унинг фикрига кўра, одамларнинг билим ортидан пул топишга ҳаракат қилиши – табиий ҳолат. Шу сабабдан ҳам математика, физика, кимё, биология фанларидан иқтидорли бўлиб, шу фанлар йўналишидаги ОТМларни битираётган ёшлар ҳозир ўқув марказларида дарс бериб яхши пул топишни кўзламоқда. Бу фанларда илм билан шуғулланаётганларнинг даромади эса унчалик яхши эмас. Даромад пастлиги эса болаларнинг ўқишга бўлган қизиқишини пасайтиради.“Масалан, ахборот технологиялари йўналишида ёшлар билимни пулга айлантиришни ўз кўзлари билан кўрмоқда. Натижа нима бўлмоқда, ҳозир ахборот технологиялари фанини ўқитувчилар кўмагида ва ҳатто мустақил ўрганишга талаб ошиб кетди. Бу дегани мазкур фандан билим сифати ҳам табиийки кўтарилди. Хулоса шуки, қачонки билимни пулга айлантириш имконияти бўлса, айни ўша фанларни ёшлар иштиёқ билан, керак бўлса мустақил изланиб ҳам яхши ўзлаштиради”, дейди Исроил Тиллабоев.Қизиқувчанликни сўндириб қўймаслик керакМафтуна Бадалова, Халқаро кимё олимпиадаси кумуш медали соҳиби:Болалар жуда қизиқувчан бўлади, кўп саволлар беришади. Масалан, улар “Нега ўт яшил?” деб сўраши мумкин. Катталар бу саволга қандай жавоб беради: “Ким билсин?”, “Бундай саволларни беришни бас қил” ва шу каби.Лекин бу савол ўйлаб қарасак, фундаментал биология, биокимё назарияларини қамраб олади. Агарда катталар “Бу жуда қизиқ савол, лекин мен ҳам жавобини билмайман, балким бирга жавобини аниқлармиз” ёки, “Бу саволнинг жавобини ҳеч ким билмайди, балким катта бўлганингда айнан сен унинг жавобини топарсан”, деб жавоб берганида, анча яхшироқ бўларди деб ўйлайман. Боладаги қизиқувчанликни сўндирмаслик керак. Қизиқувчанлик сўнса, у ўрганишдан тўхтайди.“Бизда амалиётда қўллаш учун эмас, тест ёдлаш учун ўқиш кучли...”Азиза Абдувалиева, Халқаро биология олимпиадаси олтин ва бронза медаллари соҳиби:Ижтимоий фанларга қизиқишнинг кучлилиги фанлар моҳияти билан боғлиқ, деб ўйлайман. Масалан, ижтимоий фанларда, асосан, ёдлаш керак бўлса, биология, кимё, физика каби фанларда назарияни билишдан ташқари уни ҳаётдаги турли вазиятларда қўллай олиш ҳам керак. Бу эса ўқувчидан ўз устида доимий ишлашни талаб қилади.Мактаб ўқувчиларининг асосий қисми фанларни ДТМ тестларини ечиш учун яхши ўзлаштиришга ҳаракат қилади. Агар улар ёдлаб тестда яхши натижа кўрсатиш ўрнига фан моҳиятини англашга ҳаракат қилганда аниқ ва табиий фанларга қизиқиш юқорироқ бўларди.Бундан ташқари, аниқ ва табиий фанларни яхши ўрганиш учун ресурслар ҳам муҳим ўринга эга. Ресурсларга жиҳозлар, маълум аппаратлар, кўрсатиладиган манба ва тажрибаларда ишлатиладиган асбоб-ускуналар киради. Фанларни ўқитишда кўпроқ кўз билан кўриб, тасаввур бера оладиган усуллардан, лаборатория машғулотларидан фойдаланиш керак.Ҳозир ўқиш билан бирга биология фанидан дарс ҳам беряпман. Охирги 2 йилда кимё ва биология фанидан дарсликлар анча ўзгарди. Уларни такомиллаштириб бориш билан бирга ўқувчиларга дарсликлар билан қандай ишлашни, қўшимча мустақил ўрганиш заруратини ҳам ўргатиб бориш керак. Масалан, баъзи ўқувчилар янгиланган дарсликлар ҳақида “эски дарсликлар яхшироқ эди, уларда маълумот кўп эди”, деган фикрни айтишади. Сабаби улар дарсликлардаги қора штрихларда кўрсатилган сонларни ёдлашга ўрганиб қолган. Берилган қизиқарли маълумотлар асосида интернетдан қўшимча маълумотлар топиб ўқишга, “self-study” қилишга ҳали ўрганмаган.', 'images/1675000525.jpg', 4, 0, '2023-01-29 08:55:25', '2023-01-29 08:55:35'),
(3, 'EPSILON (EDC): Талимаржон-4 қудуғи 30 минг кубметр кунлик ҳажмда газ бера бошлади', 'Жорий йил 29 январ куни Қашқадарё вилояти, Талимаржон конидаги 4-сонли қудуқда олиб борилган тиклаш ишлари  ундан саноат миқёсидаги газ оқими олиниши билан якунланди.', 'images/1675000601.jpg', 4, 0, '2023-01-29 08:56:41', '2023-01-29 08:56:41'),
(4, 'Бизнесга айланган новвойчилик. Европача нон семиртирмайдими?', 'Муслим Ҳакимов ғовакли ва қарсилдоқ нонларини қандай тайёрлашини кўриш учун тонг саҳарда йўлга чиқдик. Новвойга ҳамроҳлик қилиб, печкаларни созлаган ҳолда ишни бошлаб юбордик. Мақсадимиз ёнғоқли нон тайёрлаб кўриш эди.\r\n\r\nМаълум бўлишича, жараён хамиртуруш билан бошланади, айнан хамиртуруш – новвойнинг бош маҳсулоти, усиз нон тайёрлаб бўлмайди. Қизиғи, бу хамиртуруш 4 йилдан бери ишлатилиб, “боқиб келинаётган” экан.Кейинги босқичда тайёр маҳсулотларни хамир қориш ускунасига солиб, аралаштира бошладик. Хамир ҳароратини ўлчаган ҳолда сарёғ ва ёнғоқларни асталик билан қўшиб бордик. Хамир тайёр бўлгач, нон янада мазали чиқиши учун буғдой унидан ҳам фойдаландик. Печда пишган тайёр нонларни татиб кўриб, мазасига баҳо бердик.\r\n\r\nҚаҳрамонимиз Муслим Ҳакимов новвойликка қандай келиб қолгани, Москвада орттирган тажрибаси билан ўртоқлашди.', 'images/1675000865.jpg', 5, 0, '2023-01-29 09:01:05', '2023-01-29 09:01:05'),
(5, 'Ўзбекистондаги энг қиммат ўсимлик бизнеси — BMB Za’faron', 'Жараённи ичкаридан кўрсатиб бериш мақсадида Жиззах вилояти Бахмал туманида жойлашган нақ 200 гектарлик заъфарон плантацияларига йўл олдик. Заъфарон бизнеси мавсумий ҳисобланиб, ҳосилни йиғиб олиш ишлари октябр-ноябр ойларида якунланган, плантацияларда эса пиёзларнинг ривожланиш даври кетяпти.Ўзбекистон–Италия қўшма корхонасидаги лабораторияда териб олинган ўсимлик гулларининг толалари қадоқланади. 90-100 минг дона заъфарон гулидан 1 кг қуриган гул тумшуқчалари олинади. Плантациянинг ўзида 100 дан ортиқ ишчилар ерни ўт-майсалардан холи қилиш билан банд. Бутун дунёда кимёвий дорилардан қочиш тенденсияси ривожланиб бориши натижасида заъфаронга бўлган талаб ортиб боряпти.', 'images/1675000931.jpg', 5, 0, '2023-01-29 09:02:11', '2023-01-29 09:02:11'),
(6, 'Теннис. Жокович Циципасни мағлуб этиб, Australian Open’нинг 10 карра ғолибига айланди', 'Эркаклар ўртасидаги финал баҳсида сербиялик Новак Жокович грециялик Стефанос Циципасга қарши кортга чиқди. Уч соат давом этган финал ўйинида Жокович грециялик рақибини уч сетда 6:3, 7:6, 7:6 ҳисобларида мағлуб этиб, турнир ғолибига айланди. \r\n\r\nЖокович душанба куни ATP рейтингида Карлос Алькарасни ортда қолдириб, 1-ўринга кўтарилади.\r\nҚайд этиш жоиз, 35 ёшли теннисчи коронавирус билан боғлиқ чекловлар пайтида эмланмагани сабабли 2022 йилги Австралия очиқ чемпионатига қўйилмаган эди. \r\n\r\nШу тариқа, 2023 йилги турнир ғолиби бўлган Жокович фаолияти давомида Australian Open’нинг 10 карра чемпионига айланди.\r\n\r\nAustralian Open. Финал\r\nМельбурн, Австралия\r\nНовак Жокович (Сербия) – Стефанос Циципас (Греция) - 6:3|7:6|7:6.\r\n\r\nМаълумот учун, ушбу натижа билан Новак «катта дубулға» таснифидаги чемпионлик сонини 22тага етказиб, бу борада рекордчи бўлиб турган Рафаэль Надалга тенглашди. Жокович фаолияти давомида 10 марта Australian Open, 7 карра – «Уимблдон», 3 маротаба – US Open ва икки бор – «Ролан Гаррос» бош совринига эга чиққан. \r\n\r\nУмумий совринлари сони бўйича эса Жокович Мельбурнда 93-ғолиблигини расмийлаштириб, Надални ортда қолдиришга эришди. Сербдан олдинда фақатгина уч нафар теннисчи – Иван Лендл (94та соврин), Рожер Федерер (103) ва Жимми Коннорс (109) ўрин эгаллаган. \r\n\r\nЭслатиб ўтамиз, шанба куни аёллар ўртасидаги Австралия очиқ чемпионати финалида Қозоғистон вакиласи Елена Рибакина беларуслик Арина Соболенкога қарши баҳс олиб бориб, унда Соболенко 4/6, 6/3, 6/4 ҳисобларида ғалаба қозониб, Australian Open-2023 чемпионига айланганди.', 'images/1675001795.jpg', 2, 0, '2023-01-29 09:16:35', '2023-01-29 09:16:35'),
(7, 'Нодирбек Абдусатторов етакчиликни давом эттирмоқда. Бугун у чемпионликни расмийлаштириши мумкин', 'Шахмат бўйича Нидерландияда Tata Steel Chess 2023 турнири якунланмоқда.\r\n\r\nНодирбек Абдусатторов 12-турда америкалик Уэсли Сога қарши дона сурди ва муроса кўчасини танлади. Эндиликда ўзбекистонлик шахматчи очколари сонини 8 тага етказди ва ҳамон Masters гуруҳи пешқадами бўлиб турибди. Уни 0,5 очколик фарқ билан Аниш Гири таъқиб этмоқда. Учинчи ва тўртинчи ўринлардаги Уэсли Со ва Магнус Карлсенларда 7 тадан очко бор.', 'images/1675001831.jpg', 2, 0, '2023-01-29 09:17:11', '2023-01-29 09:17:11'),
(8, 'Бектемир Мелиқўзиев америкалик боксчини нокаутга учратди', 'Профессионал бокснинг супер ўрта вазн тоифасида ҳаракат қилаётган Бектемир Мелиқўзиев (11-1, 9 КО) ўзининг навбатдаги жангини ўтказди.\r\n\r\nАҚШнинг Инглвуд шаҳрида (Калифорния штати) ўтказилган бокс оқшомида ўзбекистонлик спортчига америкалик Улисес Сиэрра (17-3-2, 10 КО) рақиб бўлди.\r\n\r\nБектемир Мелиқўзиев 3-раунд тугашига 5 сония қолганда тана қисмига берилган навбатдаги зарба билан рақибини нокаутга учратди ва WБО Глобал чемпионлик камарини қўлга киритди.\r\n\r\nЖанг Ўзбекистон вакилининг устунлигида бошланди. Учинчи раунднинг сўнгида Бектемир рақибининг тана қисмига кучли зарба йўллаб, Сиэррани нокаутга учратди.', 'images/1675001869.png', 2, 0, '2023-01-29 09:17:49', '2023-01-29 09:17:49'),
(9, 'Эроннинг стратегик объектларига ҳужум қилинди', 'Якшанбага ўтар кечаси Эрондаги ҳарбий инфратузилма объектларида давомли портлашлар рўй берди.\r\n\r\nIRNA агентлиги хабарига кўра, Эрон шимоли-ғарбидаги Шарқий Озарбойжон вилоятидаги Азаршаҳрда мотор мойлари ишлаб чиқариладиган йирик завод ёниб кетган. Бу регион шу куни 5,9 балли зилзила қайд этилиб, 2 киши ҳалок бўлган ва 580 киши жабрланган Ғарбий Озарбойжон вилояти билан чегарадош ҳисобланади.\r\n\r\nИслом инқилоби муҳофизлари корпусига алоқадор саналган Fars агентлигига кўра, Шарқий Озарбойжон вилояти маркази бўлмиш Табриз шаҳри атрофидаги корхонада ёнғин рўй берган.\r\n\r\nTasnim янгиликлар агентлиги хабар қилишича, мамлакат марказий қисмидаги Исфаҳон провинциясида жойлашган ўқ-дори ишлаб чиқариладиган ҳарбий завод ҳам дронлар ҳужумига учраган.\r\n\r\nШунингдек Эрон ғарбидаги Дизфул шаҳридаги авиабазада портлаш рўй берган, мамлакат ғарбидаги Ҳамадон ҳамда мамлакат шимолидаги Ришт шаҳрида портлаш ва ёнғинлар кузатилгани хабар қилинган.', 'images/1675009053.jpg', 3, 0, '2023-01-29 11:17:33', '2023-01-29 11:17:33'),
(10, 'Пригожин вагнерчилар Бахмут яқинидаги посёлкани эгаллаганини айтди', '«Вагнер» хусусий ҳарбий компанияси жангчилари Бахмутдан шимолда жойлашган Блаҳодатное қишлоғини эгаллаган. Бу ҳақда ушбу ХҲК раҳбари Евгений Пригожин маълум қилди.\r\n\r\n«Вагнер» ХҲК бўлинмалари Блаҳодатноени эгаллади. Блаҳодатное бизнинг назоратимиз остида», — дейилади унинг матбуот хизмати хабарида.\r\n\r\nРоссия мудофаа вазирлиги Пригожиннинг бу сўзларини тасдиқламаган.', 'images/1675009097.jpg', 3, 0, '2023-01-29 11:18:17', '2023-01-29 11:18:17'),
(11, 'Нурмат Отабеков: Мавсумий касалликлар сабаб ўқув муассасаларида таълим жараёнини тўхтатишга асос йўқ', 'Ҳозирда аксарият мамлакатлар қатори Ўзбекистонда ҳам мавсумий касалликлар тарқалиши кўпайган. Айниқса, болаларда бу жараён бироз оғир кечмоқда.\r\n\r\nЎзбекистонда ўткир респиратор касалликлар тарқалиши билан боғлиқ эпидемиологик вазият қандай? ССВ матбуот хизмати ушбу савол билан Санитария-эпидемиологик осойишталик ва жамоат саломатлиги қўмитаси раиси биринчи ўринбосари Нурмат Отабековга мурожаат қилди.', 'images/1701976074.jpg', 4, 0, '2023-12-07 14:07:55', '2023-12-07 14:07:55'),
(12, 'Ўзига 100 млн, мураббийига 50 млн. Шахмат бўйича жаҳон чемпиони Афруза Ҳамдамова тантанали кутиб олинди', '12−25-ноябр кунлари Италиянинг Монтесилвано шаҳрида шахмат бўйича ёшлар ўртасидаги жаҳон чемпионати бўлиб ўтди. Унда ўзбекистонлик 3 нафар шахматчи ҳам қатнашиб, мамлакатимиз шарафини ҳимоя қилди. Эътиборлиси, чемпионатнинг 14 ёшгача бўлган ёш тоифасида Афруза Ҳамдамова муддатидан олдин жаҳон чемпиони бўлди ва Афруза Ўзбекистон тарихида қизлар ўртасидаги илк жаҳон чемпионига айланди.\r\n\r\nТошкент халқаро аэропортида шахмат бўйича ёшлар ўртасида жаҳон чемпионатида иштирок этган шахматчиларни кутиб олиш маросими бўлиб ўтди. Президент ёрдамчиси Саида Мирзиёева 26-ноябр тонгида Ўзбекистонга қайтиб келган Афрузани шахсан кутиб олди. Саида Мирзиёева қизнинг бош мураббийи — отаси Акбар Ҳакимовга алоҳида миннатдорлик билдирди.', 'images/1701976153.jpg', 2, 0, '2023-12-07 14:09:13', '2023-12-07 14:09:13');

-- --------------------------------------------------------

--
-- Структура таблицы `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `created_at`, `updated_at`) VALUES
(1, 'Uljan', 'Uljan@gmail.com\n', '1234', NULL, NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Индексы таблицы `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `news`
--
ALTER TABLE `news`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
